zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F81xxx/MC56F81768/drivers/fsl_clock.c
        case kCLOCK_SysClk:
            u32Freq = CLOCK_GetMstr2xFreq() / 2U;
            break;

        case kCLOCK_BusClk:
            u32Freq = CLOCK_GetMstr2xFreq() / 2U;
            if (0U != (SIM->MISC0 & SIM_MISC0_MODE_STAT_MASK))
            {
                /* fast mode */
                u32Freq /= 2U;
            }
            break;

        case kCLOCK_Bus2xClk:
            u32Freq = CLOCK_GetMstr2xFreq();
            if (0U != (SIM->MISC0 & SIM_MISC0_MODE_STAT_MASK))
            {
                /* fast mode */
                u32Freq /= 2U;
            }
            break;

        case kCLOCK_FlashClk:
            u32Freq = CLOCK_GetMstr2xFreq() / 4U;
            if (0U != (SIM->MISC0 & SIM_MISC0_MODE_STAT_MASK))
            {
                /* fast mode */
                u32Freq /= 2U;
            }
            break;

        case kCLOCK_FastIrcClk:
            u32Freq = CLOCK_GetFastIrcFreq();
            break;

        case kCLOCK_SlowIrcClk:
            u32Freq = CLOCK_GetSlowIrcFreq();
            break;

        case kCLOCK_CrystalOscClk:
            u32Freq = CLOCK_GetXtalFreq();
            break;

        case kCLOCK_ExtClk:
            u32Freq = CLOCK_GetExtClockFreq();
            break;

        case kCLOCK_MstrOscClk:
            u32Freq = CLOCK_GetMstrOscFreq();
            break;

        case kCLOCK_PllDiv2Clk:
            u32Freq = CLOCK_GetPllDiv2Freq();
            break;

        default:
            assert(false);
            break;
    }
    return u32Freq;
}

/*!
 * brief Get IP clock frequency.
 *
 * param eIpClkName IP clock name.
 *
 * return The required IP clock's frequency in Hz.
 */
uint32_t CLOCK_GetIpClkSrcFreq(clock_ip_name_t eIpClkName)
{
    uint32_t u32Freq = 0U;
    switch (eIpClkName)
    {
        case kCLOCK_TA0:
        case kCLOCK_TA1:
        case kCLOCK_TA2:
        case kCLOCK_TA3:
            /* Qtimer has various clock source, this function only return bus or bus_2x clock for it. */
            u32Freq = CLOCK_GetFreq(kCLOCK_Bus2xClk);
            if ((SIM->PCR & (1UL << SIM_PCR_TMR_CR_SHIFT)) == 0U)
            {
                /* Not 2X clock */
                u32Freq /= 2U;
            }
            break;

        case kCLOCK_LPI2C0:
        case kCLOCK_LPI2C1:
            u32Freq = CLOCK_GetLpi2cFreq(eIpClkName);
            break;

        case kCLOCK_QSPI0:
        case kCLOCK_DAC:
        case kCLOCK_CYCADC:
        case kCLOCK_CMPA:
        case kCLOCK_CMPB:
        case kCLOCK_CMPC:
        case kCLOCK_CMPD:
        case kCLOCK_OPAMPB:
        case kCLOCK_OPAMPA:
        case kCLOCK_CRC:
            u32Freq = CLOCK_GetFreq(kCLOCK_BusClk);
            break;

        case kCLOCK_QSCI0:
        case kCLOCK_QSCI1:
            u32Freq = CLOCK_GetQsciFreq(eIpClkName);
            break;

        case kCLOCK_QDC:
            u32Freq = CLOCK_GetFreq(kCLOCK_Bus2xClk);
            if ((SIM->PCR & (1UL << SIM_PCR_QDC_CR_SHIFT)) == 0U)
            {
                /* Not 2X clock */
                u32Freq /= 2U;
            }
            break;

        case kCLOCK_ROM:
            u32Freq = CLOCK_GetFreq(kCLOCK_SysClk);
            break;

        case kCLOCK_PWMACH0:
        case kCLOCK_PWMACH1:
        case kCLOCK_PWMACH2:
        case kCLOCK_PWMACH3:
            u32Freq = CLOCK_GetFreq(kCLOCK_Bus2xClk);
            if ((SIM->PCR & (1UL << SIM_PCR_PWM_CR_SHIFT)) == 0U)
            {
                /* Not 2X clock */
                u32Freq /= 2U;
            }
            break;

        case kCLOCK_PIT1:
        case kCLOCK_PIT0:
            /* For these IPs, check IP's RM to know which clock source is selected and
             * get corresponding clock separately */
            break;

        default:
            assert(false);
            break;
    }

    return u32Freq;
}

/*!
 * brief Set Clock IN 0 frequency.
 *
 * It is a must to call this function in advance if system is operated by clkin0.
 *
 * param u32Freq Clock IN 0 frequency in Hz.
 */
void CLOCK_SetClkin0Freq(uint32_t u32Freq)
{
    assert(u32Freq != 0U);
    assert(u32Freq <= OCCS_MAX_CLK_IN_FREQ);
    g_u32ClockClkin0Freq = u32Freq;
}

/*!
 * brief Set Clock IN 1 frequency.
 *
 * It is a must to call this function in advance if system is operated by clkin1
 *
 * param u32Freq Clock IN 1 frequency in Hz.
 */
void CLOCK_SetClkin1Freq(uint32_t u32Freq)
{
    assert(u32Freq != 0U);
    assert(u32Freq <= OCCS_MAX_CLK_IN_FREQ);
    g_u32ClockClkin1Freq = u32Freq;
}

/*!
 * brief Set crystal oscillator frequency.
 *
 * It is a must to call this function in advance if system is operated by crystal oscillator.
 *
 * param u32Freq Crystal oscillator frequency in Hz.
 */
void CLOCK_SetXtalFreq(uint32_t u32Freq)
{
    assert(u32Freq >= OCCS_MIN_CRYSTAL_FREQ);
    assert(u32Freq <= OCCS_MAX_CRYSTAL_FREQ);
    g_u32ClockXtalFreq = u32Freq;
}

/*!
 * brief Config clock register access protection mode.
 *
 * param psConfig Pointer for protection configuration.
 */
void CLOCK_SetProtectionConfig(clock_protection_config_t *psConfig)
{
    OCCS->PROT =
        OCCS_PROT_FRQEP(psConfig->eFrqEP) | OCCS_PROT_OSCEP(psConfig->eOscEP) | OCCS_PROT_PLLEP(psConfig->ePllEP);
}

/*!
 * brief Config output clock.
 *
 * param psConfig Pointer for clock output configuration.
 */
void CLOCK_SetOutputClockConfig(clock_output_config_t *psConfig)
{
    uint16_t u16Reg;

    assert(NULL != psConfig);

    /* clock output0 and clock output1 share the same divider */
    u16Reg = SIM_CLKOUT_CLKODIV(psConfig->eClkDiv);

    if (psConfig->bClkOut0En)
    {
        u16Reg &= ~SIM_CLKOUT_CLKDIS0_MASK;
        u16Reg |= SIM_CLKOUT_CLKOSEL0(psConfig->eClkOut0Src);
    }
    else
    {
        u16Reg |= SIM_CLKOUT_CLKDIS0_MASK;
    }

    if (psConfig->bClkOut1En)
    {
        u16Reg &= ~SIM_CLKOUT_CLKDIS1_MASK;
        u16Reg |= SIM_CLKOUT_CLKOSEL1(psConfig->eClkOut1Src);
    }
    else
    {
        u16Reg |= SIM_CLKOUT_CLKDIS1_MASK;
    }

    SIM->CLKOUT = u16Reg;
}

/*!
 * brief Config mcu operation clock.
 *
 * It is recommended to set the multilink debug shift freq to 100KHz or lower when debug
 * the 2M FIRC setting, otherwise the multilink may can't connect to device.
 * Below is a valid FIRC 2M clock setting demo, clock path: FIRC(2M)->MSTR OSC->DIV1->MSTR 2X
 *   .bCrystalOscEnable = false;
 *   .bFircEnable       = true;
 *   .bSircEnable       = false;
 *   .bPllEnable        = false;
 *   .eFircSel          = kCLOCK_FircSel_2M;
 *   .eMstrOscClkSrc    = kCLOCK_MstrOscClkSrcFirc;
 *   .eMstr2xClkSrc     = kCLOCK_SysClkSrcMstrOsc;
 *   .eMstr2xClkPostScale = kCLOCK_PostscaleDiv1;
 *
 * If set the SIRC(200KHz) as Mstr2x clock, the debugger can't connect to the device.
 * So be careful to set the SIRC clock configuration, because it's difficult to debug.
 * Below is a valid SIRC 200K clock setting demo, clock path: SIRC->MSTR OSC->DIV1->MSTR 2X
 *   .bCrystalOscEnable = false;
 *   .bFircEnable       = false;
 *   .bSircEnable       = true;
 *   .bPllEnable        = false;
 *   .eMstrOscClkSrc    = kCLOCK_MstrOscClkSrcSirc;
 *   .eMstr2xClkSrc     = kCLOCK_SysClkSrcMstrOsc;
 *   .eMstr2xClkPostScale = kCLOCK_PostscaleDiv1;
 *
 * param psConfig Pointer for clock configuration.
 */
void CLOCK_SetClkConfig(clock_config_t *psConfig)
{
    /* sysClkSrc switch back to mstr_osc */
    OCCS->CTRL &= ~OCCS_CTRL_ZSRC_MASK;

