zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F81xxx/MC56F81768/drivers/fsl_clock.c
    /* wait the switch done */
    while ((OCCS->STAT & OCCS_STAT_ZSRCS_MASK) != OCCS_STAT_ZSRCS(kCLOCK_Mstr2xClkSrcMstrOsc))
    {
    }

    /* disable PLL */
    OCCS->CTRL |= OCCS_CTRL_PLLPD_MASK;

    /* Enable clock firstly */
    if (psConfig->bFircEnable)
    {
        OCCS->OSCTL1 &= ~OCCS_OSCTL1_ROPD_MASK;
        if (psConfig->eFircSel == kCLOCK_FircSel_8M)
        {
            OCCS->OSCTL1 &= ~OCCS_OSCTL1_ROSB_MASK;
        }
        else
        {
            /* kCLOCK_FircSel_2M */
            OCCS->OSCTL1 |= OCCS_OSCTL1_ROSB_MASK;
        }
    }

    if (psConfig->bSircEnable)
    {
        OCCS->OSCTL2 &= ~OCCS_OSCTL2_ROPD200K_MASK;
    }

    if (psConfig->bCrystalOscEnable)
    {
        /* set crystal osc mode */
        if (psConfig->eCrystalOscMode == kCLOCK_CrystalOscModeFSP)
        {
            OCCS->OSCTL1 &= ~OCCS_OSCTL1_COHL_MASK;
        }
        else
        {
            /* kCLOCK_CrystalOscModeLCP */
            OCCS->OSCTL1 |= OCCS_OSCTL1_COHL_MASK;
        }

        /* Not support bypass mode, disable it by default */
        OCCS->OSCTL1 &= ~OCCS_OSCTL1_CLK_MODE_MASK;

        /* Enable the crystal oscillation and wait it get stable */
        OCCS->OSCTL2 &= ~OCCS_OSCTL2_COPD_MASK;
        while ((OCCS->STAT & OCCS_STAT_OSC_OK_MASK) == 0U)
        {
        }

        if (psConfig->bCrystalOscMonitorEnable)
        {
            OCCS->OSCTL2 |= OCCS_OSCTL2_MON_ENABLE_MASK;
        }
        else
        {
            OCCS->OSCTL2 &= ~OCCS_OSCTL2_MON_ENABLE_MASK;
        }
    }

    if (kCLOCK_ExtClkSrcCrystalOsc == psConfig->eExtClkSrc)
    {
        OCCS->OSCTL1 &= ~(OCCS_OSCTL1_CLK_MODE_MASK | OCCS_OSCTL1_EXT_SEL_MASK);
    }
    else
    {
        if (kCLOCK_SelClkIn0 == psConfig->eClkInSel)
        {
            SIM->MISC0 &= ~SIM_MISC0_CLKINSEL_MASK;
        }
        else
        {
            /* kCLOCK_SelClkIn1 */
            SIM->MISC0 |= SIM_MISC0_CLKINSEL_MASK;
        }
        OCCS->OSCTL1 |= OCCS_OSCTL1_EXT_SEL_MASK;
    }

    /* Safety check before PRECS switch.
     * Here should only check each clock enable in config as below.
     * The reason not check the enable bit in register for FIRC/SIRC/Crystal oscillator,
     * is that they may be turned off at next step. */
    switch (psConfig->eMstrOscClkSrc)
    {
        case kCLOCK_MstrOscClkSrcFirc:
            clk_assert(psConfig->bFircEnable);
            clk_assert(0U == (OCCS->OSCTL1 & OCCS_OSCTL1_CLK_STOP_MASK));
            break;

        case kCLOCK_MstrOscClkSrcSirc:
            clk_assert(psConfig->bSircEnable);
            break;

        case kCLOCK_MstrOscClkSrcExt:
            if (kCLOCK_ExtClkSrcCrystalOsc == psConfig->eExtClkSrc)
            {
                clk_assert(psConfig->bCrystalOscEnable);
            }
            else
            {
                /* the external clock is from clkin, SW can't verify if it is on */
            }
            break;

        default:
            clk_assert(false);
    }

    /* mstr_osc switch to setting value */
    OCCS->CTRL = (OCCS->CTRL & (~OCCS_CTRL_PRECS_MASK)) | OCCS_CTRL_PRECS(psConfig->eMstrOscClkSrc);

    /* wait 6 NOP for the clock transition done */
    __NOP();
    __NOP();
    __NOP();
    __NOP();
    __NOP();
    __NOP();

    /* turn off all disable clock source */
    if (!(psConfig->bFircEnable))
    {
        OCCS->OSCTL1 |= OCCS_OSCTL1_ROPD_MASK;
    }

    if (!(psConfig->bSircEnable))
    {
        OCCS->OSCTL2 |= OCCS_OSCTL2_ROPD200K_MASK;
    }

    if (!(psConfig->bCrystalOscEnable))
    {
        OCCS->OSCTL2 |= OCCS_OSCTL2_COPD_MASK;
    }

    /* setting pll */
    if (psConfig->bPllEnable)
    {
        uint32_t u32MstrOscClkFreq = 0U;
        uint16_t u16PllDiv;
        clk_assert(psConfig->u32PllClkFreq >= OCCS_MIN_PLL_FREQ);
        clk_assert(psConfig->u32PllClkFreq <= OCCS_MAX_PLL_FREQ);

        switch (psConfig->eMstrOscClkSrc)
        {
            case kCLOCK_MstrOscClkSrcExt:
                u32MstrOscClkFreq = CLOCK_GetExtClockFreq();
                break;
            case kCLOCK_MstrOscClkSrcFirc:
                u32MstrOscClkFreq = CLOCK_GetFastIrcFreq();
                clk_assert(u32MstrOscClkFreq == OCCS_INTERNAL_FIRC_N_FREQ);
                break;
            default:
                /* not support other configurations */
                clk_assert(false);
        }

        clk_assert(0U != u32MstrOscClkFreq);

        /* Check and config the PLL multiplier */
        u16PllDiv = (uint16_t)(psConfig->u32PllClkFreq / u32MstrOscClkFreq);

        clk_assert(u16PllDiv >= 1U);
        clk_assert(u16PllDiv <= 64U);

        OCCS->DIVBY = (OCCS->DIVBY & (~OCCS_DIVBY_PLLDB_MASK)) | OCCS_DIVBY_PLLDB(u16PllDiv - 1U);
        OCCS->CTRL |= OCCS_CTRL_LCKON_MASK;

        /* power on PLL and wait it get locked */
        OCCS->CTRL &= ~OCCS_CTRL_PLLPD_MASK;
        while ((OCCS->STAT & OCCS_STAT_LCK0_MASK) == 0U)
        {
        }
        while ((OCCS->STAT & OCCS_STAT_LCK1_MASK) == 0U)
        {
        }

        /* Automatically config the PWM_DIV2 bitfield based on setting PLL frequency */
        if (psConfig->u32PllClkFreq == OCCS_MAX_PLL_FREQ)
        {
            OCCS->DIVBY |= OCCS_DIVBY_PWM_DIV2_MASK;
        }
        else if (psConfig->u32PllClkFreq == (OCCS_MAX_PLL_FREQ / 2U))
        {
            OCCS->DIVBY &= ~OCCS_DIVBY_PWM_DIV2_MASK;
        }
        else
        {
            /* Not touch the PWM_DIV2 bitfield in DIVBY register */
        }
    }

    OCCS->DIVBY = (OCCS->DIVBY & (~OCCS_DIVBY_COD_MASK)) | OCCS_DIVBY_COD(psConfig->eMstr2xClkPostScale);

    /* switch mstr_clk_2x to desired source.
     * Note: it is already switched to mstr_osc at the beginning of this function
     */
    if (psConfig->eMstr2xClkSrc == kCLOCK_Mstr2xClkSrcPllDiv2)
    {
        uint32_t u32Mstr2xClkFreq;
        clk_assert((OCCS->CTRL & OCCS_CTRL_PLLPD_MASK) == 0U);

        u32Mstr2xClkFreq = (psConfig->u32PllClkFreq / 2U) >> ((uint16_t)(psConfig->eMstr2xClkPostScale));
        if (0U != (SIM->MISC0 & SIM_MISC0_MODE_STAT_MASK))
        {
            /* Fast mode */
            clk_assert(u32Mstr2xClkFreq <= (SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY * 2U));
        }
        else
        {
            /* Normal mode */
            clk_assert(u32Mstr2xClkFreq <= SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);
        }

        OCCS->CTRL |= OCCS_CTRL_ZSRC_MASK;
        while ((OCCS->STAT & OCCS_STAT_ZSRCS_MASK) != OCCS_STAT_ZSRCS(kCLOCK_Mstr2xClkSrcPllDiv2))
        {
        }
    }
}

/*!
 * brief Set clock mode, normal or fast mode.
 *
 * Note: This function will do software reset if setting mode differs current mode, otherwise it does nothing.
 *
 * param eClkMode Setting clock mode.
 */
void CLOCK_SetClockMode(clock_mode_t eClkMode)
{
    if (SIM_MISC0_MODE_STAT(eClkMode) != (SIM->MISC0 & SIM_MISC0_MODE_STAT_MASK))
    {
        SIM->MISC0 = (SIM->MISC0 & (~((uint16_t)SIM_MISC0_FAST_MODE_MASK))) | SIM_MISC0_FAST_MODE(eClkMode);
        SIM->CTRL |= SIM_CTRL_SWRST_MASK;
    }
}

/*!
 * brief Evaluate external clock frequency and return its frequency in Hz.
 *
 * This function should be called only when internal FIRC is on and 8M is selected.
 * The evaluated result accuracy depends on:
 * 1. FIRC accuracy, now it is +/-3% for full temperature range.
 * 2. Truncation error, because the external clock and FIRC is not synchronised.
 * 3. External clock frequency, low accuracy for lower external clock frequency.
 * 4. MCU mstr 2x clock.
 *
 * For example, for namely 8M external clock, evaluated result may be range in 8M+/-7%.
 *
 * return Evaluated external frequency in Hz.
 */
uint32_t CLOCK_EvaluateExtClkFreq(void)
{
    /* FIRC must power on, output, 8M. */
    assert(0U == (OCCS->OSCTL1 & (OCCS_OSCTL1_ROPD_MASK | OCCS_OSCTL1_ROSB_MASK | OCCS_OSCTL1_CLK_STOP_MASK)));

    /* Start evaluation and wait it finished. */
    OCCS->CLKCHKR |= OCCS_CLKCHKR_CHK_ENA_MASK;
    while (0U != (OCCS->CLKCHKR & OCCS_CLKCHKR_CHK_ENA_MASK))
    {
    }

