zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F81xxx/MC56F81768/drivers/fsl_clock.c
    return (OCCS_EXT_CLK_CHECK_REF_FREQ / 128UL) * OCCS->CLKCHKT;
}

/*!
 * brief Enable/Disable PLL monitor interrupt.
 *
 * This function should be called only when PLL is on and its reference clock is external clock.
 * This function is for safety purpose when external clock is lost due to HW failure.
 * The normal flow to call this function:
 * 1. Call CLOCK_SetClkConfig to enable PLL and external clock to feed the PLL.
 * 2. Call CLOCK_ClearPLLMonitorFlag.
 * 3. Call CLOCK_SetPllLossofRefererntTripPoint (optional, setting value is for kCLOCK_PllMonitorLostofReferClk type).
 * 4. Call this function.
 * 5. Enable OCCS interrupt with highest priority 3.
 * 6. When OCCS interrupt occurs, recover clock from the disaster in OCCS_DriveISRHandler function. Such kind of clock
 * recovery is application dependent, and a demo OCCS_DriveISRHandler has been shown in fsl_clock.c
 *
 * param eType PLL monitor type.
 * param bEnable Enable or disable.
 */
void CLOCK_EnablePLLMonitorInterrupt(clock_pll_monitor_type_t eType, bool bEnable)
{
    /* PLL must be on and get locked and its ref clock must be ext clock. */
    assert(0U == (OCCS->CTRL & OCCS_CTRL_PLLPD_MASK));
    assert(OCCS_CTRL_PRECS(kCLOCK_MstrOscClkSrcExt) == (OCCS->CTRL & OCCS_CTRL_PRECS_MASK));
    assert(OCCS_STAT_LCK0_MASK == (OCCS->STAT & OCCS_STAT_LCK0_MASK));
    assert(OCCS_STAT_LCK1_MASK == (OCCS->STAT & OCCS_STAT_LCK1_MASK));

    switch (eType)
    {
        case kCLOCK_PllMonitorUnLockCoarse:
            if (bEnable)
            {
                /* enable falling edge of LCK0, that is pll coarse unlock */
                OCCS->CTRL = (OCCS->CTRL & (~OCCS_CTRL_PLLIE0_MASK)) | OCCS_CTRL_PLLIE0(2U);
            }
            else
            {
                OCCS->CTRL &= ~OCCS_CTRL_PLLIE0_MASK;
            }
            break;

        case kCLOCK_PllMonitorUnLockFine:
            if (bEnable)
            {
                /* enable falling edge of LCK1, that is pll fine unlock */
                OCCS->CTRL = (OCCS->CTRL & (~OCCS_CTRL_PLLIE1_MASK)) | OCCS_CTRL_PLLIE1(2U);
            }
            else
            {
                OCCS->CTRL &= ~OCCS_CTRL_PLLIE1_MASK;
            }
            break;

        case kCLOCK_PllMonitorLostofReferClk:
            if (bEnable)
            {
                OCCS->CTRL |= OCCS_CTRL_LOCIE_MASK;
            }
            else
            {
                OCCS->CTRL &= ~OCCS_CTRL_LOCIE_MASK;
            }
            break;

        case kCLOCK_PllMonitorAll:
            if (bEnable)
            {
                OCCS->CTRL = (OCCS->CTRL & (~(OCCS_CTRL_PLLIE0_MASK | OCCS_CTRL_PLLIE1_MASK | OCCS_CTRL_LOCIE_MASK))) |
                             (OCCS_CTRL_PLLIE0(2U) | OCCS_CTRL_PLLIE1(2U) | OCCS_CTRL_LOCIE_MASK);
            }
            else
            {
                OCCS->CTRL &= (~(OCCS_CTRL_PLLIE0_MASK | OCCS_CTRL_PLLIE1_MASK | OCCS_CTRL_LOCIE_MASK));
            }
            break;

        default:
            assert(false);
            break;
    }
}

/*!
 * brief Enable IRC8M monitor.
 *
 * note: It requires IRC8M and IRC200K to be enabled.
 *
 * param u16LowThre Low threshold
 * param u16HighThre High threshold.
 */
void CLOCK_EnableFirc8MMonitor(uint16_t u16LowThre, uint16_t u16HighThre)
{
    /* Make sure IRC 8M enabled and output */
    assert(0U == (OCCS->OSCTL1 & (OCCS_OSCTL1_ROPD_MASK | OCCS_OSCTL1_ROSB_MASK | OCCS_OSCTL1_CLK_STOP_MASK)));

    /* Make sure IRC 200K enabled */
    assert(0U == (OCCS->OSCTL2 & OCCS_OSCTL2_ROPD200K_MASK));

    OCCS->CTRL &= (uint16_t)(~OCCS_CTRL_IRC8M_MON_EN_MASK);
    CLOCK_ClearFirc8MMonitorInterruptFlag();
    OCCS->IRC8M_MON_THR_HI = u16HighThre;
    OCCS->IRC8M_MON_THR_LO = u16LowThre;
    OCCS->CTRL |= OCCS_CTRL_IRC8M_MON_EN_MASK;
}

/*!
 * brief IRC8M monitor usage.
 *
 * This function demos the usage of IRC8M monitor via clock driver API.
 *
 * return IRC8M monitor test result.
 *         true: 8M monitor failed, result exceeds threshold, +/-10%
 *         false: 8M monitor result is within threshold, +/-10%
 */
bool CLOCK_IRC8MMonitorOnce(void)
{
    bool result = false;
#define IRC_8M_MONITOR_THRE (OCCS_INTERNAL_FIRC_N_FREQ / OCCS_INTERNAL_SIRC_FREQ * 10U)

    CLOCK_EnableFirc8MMonitor((uint16_t)(IRC_8M_MONITOR_THRE * (100U - 10U) / 100U),
                              (uint16_t)(IRC_8M_MONITOR_THRE * (100U + 10U) / 100U));

    /* Wait at least 10 clocks of IRC 200K, extend 10 for sure */
    SDK_DelayAtLeastUs(1000000UL / OCCS_INTERNAL_SIRC_FREQ * (10U + 10U), CLOCK_GetFreq(kCLOCK_SysClk));

    result = CLOCK_GetFirc8MMonitorInterruptFlag();
    CLOCK_DisableFirc8MMonitor();
    CLOCK_ClearFirc8MMonitorInterruptFlag();

    return result;
}

/*!
 * brief OCCS Interrupt handler.
 *
 * This function handle situation when the PLL unlock/loss of reference clock.
 * The handle process is application dependent and here demo how to recover the clock.
 */
void OCCS_DriverIRQHandler(void);
void OCCS_DriverIRQHandler(void)
{
    /* For the case that OCCS interrupt priority is 3 and re-enable PLL in this handler,
     * another OCCS interrupt occurs, this cause a nested OCCS interrupt, which is not desired.
     * So disable the OCCS interrupt at beginning. */
    DisableIRQ(OCCS_IRQn);

    /* Only handle the case that the external clock is used as MstrOSC */
    if (OCCS_CTRL_PRECS(kCLOCK_MstrOscClkSrcExt) == (OCCS->CTRL & OCCS_CTRL_PRECS_MASK))
    {
        /* Enable FIRC, 8M, output */
        OCCS->OSCTL1 &= ~(OCCS_OSCTL1_ROPD_MASK | OCCS_OSCTL1_ROSB_MASK | OCCS_OSCTL1_CLK_STOP_MASK);

        /* Switch MstrOSC to internal 8M clock, and wait transition done */
        OCCS->CTRL = (OCCS->CTRL & (~OCCS_CTRL_PRECS_MASK)) | OCCS_CTRL_PRECS(kCLOCK_MstrOscClkSrcFirc);
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();

        /* Switch System clock to MstrOSC and wait transition done */
        OCCS->CTRL = (OCCS->CTRL & (~OCCS_CTRL_ZSRC_MASK)) | OCCS_CTRL_ZSRC(kCLOCK_Mstr2xClkSrcMstrOsc);
        while ((OCCS->STAT & OCCS_STAT_ZSRCS_MASK) != OCCS_STAT_ZSRCS(kCLOCK_Mstr2xClkSrcMstrOsc))
        {
        }

        /* Now the system get alive because its clock source is guaranteed. */

        /* Setting PLL and wait it get locked */
        OCCS->CTRL |= OCCS_CTRL_PLLPD_MASK; /* power down PLL firstly */
        OCCS->DIVBY = (OCCS->DIVBY & (~OCCS_DIVBY_PLLDB_MASK)) | OCCS_DIVBY_PLLDB(49U);
        OCCS->CTRL &= ~OCCS_CTRL_PLLPD_MASK;
        while ((OCCS->STAT & OCCS_STAT_LCK0_MASK) == 0U)
        {
        }
        while ((OCCS->STAT & OCCS_STAT_LCK1_MASK) == 0U)
        {
        }

        if (0 != (SIM->MISC0 & SIM_MISC0_MODE_STAT_MASK))
        {
            /* Fast mode, output of PLL is 400MHz, Mstr2x clk = 200M, SYS_CLK = 100MHz */
            OCCS->DIVBY = (OCCS->DIVBY & (~OCCS_DIVBY_COD_MASK)) | OCCS_DIVBY_PWM_DIV2_MASK;
        }
        else
        {
            /* Normal mode, Output of PLL is 400MHz, Mstr2x clk = 100M, SYS_CLK = 50MHz */
            OCCS->DIVBY = (OCCS->DIVBY & (~OCCS_DIVBY_COD_MASK)) | OCCS_DIVBY_COD(1U) | OCCS_DIVBY_PWM_DIV2_MASK;
        }

        /* Switch System clock to PLL and wait transition done */
        OCCS->CTRL = (OCCS->CTRL & (~OCCS_CTRL_ZSRC_MASK)) | OCCS_CTRL_ZSRC(kCLOCK_Mstr2xClkSrcPllDiv2);
        while ((OCCS->STAT & OCCS_STAT_ZSRCS_MASK) != OCCS_STAT_ZSRCS(kCLOCK_Mstr2xClkSrcPllDiv2))
        {
        }

        /* Add Application related code here , say shut down critical hardware to prevent damage. */
    }

    /* No matter what kind of interrupt, clear all flags */
    OCCS->STAT = OCCS_STAT_LOLI1_MASK | OCCS_STAT_LOLI0_MASK | OCCS_STAT_LOCI_MASK;
}
